recipes/easy-dal.org
#+TITLE: Easy dal
#+DATE: 2022-09-23
#+SETUPFILE: recipe.setup

[[https://www.instagram.com/p/ChDjD6kjsbH/][Original link]]

* Ingredients
  - 1.5 cups dry red lentils
  - 2-3 tablespoons Red Thai Curry Paste
  - 1 can of coconut milk (400 ml)
  - 1 teaspoon Kashmiri chili powder (or sub other chili powder)
  - 1/2 teaspoon turmeric
  - 2 teaspoons garam masala divided
  - 1/2 teaspoon granulated sugar
  - Salt to taste
  - Serve with Roti and Rice

* Instructions
  1. Cook lentils in water (excess water will form the base of the soup)
  2. In a seprate small pot, toast curry paste then add coconut milk and reduce. Add spices and sugar.
  3. Mix coconut milk sauce into lentils and optionally add the oyster/soy sauce to taste and add some oil (coconut)
