recipes/easy-dal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Easy dal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Easy dal</h1>
<p>
<a href="https://www.instagram.com/p/ChDjD6kjsbH/">Original link</a>
</p>

<div id="outline-container-orgdaa8d6a" class="outline-2">
<h2 id="orgdaa8d6a">Ingredients</h2>
<div class="outline-text-2" id="text-orgdaa8d6a">
<ul class="org-ul">
<li>1.5 cups dry red lentils</li>
<li>2-3 tablespoons Red Thai Curry Paste</li>
<li>1 can of coconut milk (400 ml)</li>
<li>1 teaspoon Kashmiri chili powder (or sub other chili powder)</li>
<li>1/2 teaspoon turmeric</li>
<li>2 teaspoons garam masala divided</li>
<li>1/2 teaspoon granulated sugar</li>
<li>Salt to taste</li>
<li>Serve with Roti and Rice</li>
</ul>
</div>
</div>

<div id="outline-container-org0d6954a" class="outline-2">
<h2 id="org0d6954a">Instructions</h2>
<div class="outline-text-2" id="text-org0d6954a">
<ol class="org-ol">
<li>Cook lentils in water (excess water will form the base of the soup)</li>
<li>In a seprate small pot, toast curry paste then add coconut milk and reduce. Add spices and sugar.</li>
<li>Mix coconut milk sauce into lentils and optionally add the oyster/soy sauce to taste and add some oil (coconut)</li>
</ol>
</div>
</div>
</div>
</body>
</html>
